---
title: DWFExportOptions
classe: Autodesk.Revit.DB.DWFExportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.CADExportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# DWFExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CropBoxVisible { get; set; }` | `dWFExportOptions.CropBoxVisible` | Boolean |
| `Boolean ExportingAreas { get; set; }` | `dWFExportOptions.ExportingAreas` | Boolean |
| `Boolean ExportObjectData { get; set; }` | `dWFExportOptions.ExportObjectData` | Boolean |
| `ElementId ExportOnlyViewId { get; set; }` | `dWFExportOptions.ExportOnlyViewId` | ElementId |
| `Boolean ExportTexture { get; set; }` | `dWFExportOptions.ExportTexture` | Boolean |
| `DWFImageFormat ImageFormat { get; set; }` | `dWFExportOptions.ImageFormat` | DWFImageFormat |
| `DWFImageQuality ImageQuality { get; set; }` | `dWFExportOptions.ImageQuality` | DWFImageQuality |
| `Boolean MergedViews { get; set; }` | `dWFExportOptions.MergedViews` | Boolean |
| `ExportPaperFormat PaperFormat { get; set; }` | `dWFExportOptions.PaperFormat` | ExportPaperFormat |
| `Boolean PortraitLayout { get; set; }` | `dWFExportOptions.PortraitLayout` | Boolean |
| `Boolean StopOnError { get; set; }` | `dWFExportOptions.StopOnError` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```